#### GetPartMakerMethodToDivideVolumeFW Method

---

|  |
| --- |
| PartUtils Class   See Also |

Obtains the object allowing access to the divided volume properties of the PartMaker.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public static PartMakerMethodToDivideVolumes GetPartMakerMethodToDivideVolumeFW( 	PartMaker partMaker ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function GetPartMakerMethodToDivideVolumeFW ( _ 	partMaker As PartMaker _ ) As PartMakerMethodToDivideVolumes ``` |

| Visual C++ |
| --- |
| ``` public: static PartMakerMethodToDivideVolumes^ GetPartMakerMethodToDivideVolumeFW( 	PartMaker^ partMaker ) ``` |

#### Parameters

partMaker
:   Type:  Autodesk.Revit.DB PartMaker
     The PartMaker.

#### Return Value

The object handle. Returns    a null reference (  Nothing  in Visual Basic)  if the PartMaker does not represent divided volumes.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

PartUtils Class

Autodesk.Revit.DB Namespace